{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyPj4zqb5SFy5rH08YfBuFLR"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["# Необходимо написать код на Python и оценить сложность вашего алгоритма О(N)"],"metadata":{"id":"ZIb-66Cn4y6P"}},{"cell_type":"markdown","source":["## #4. Используя цикл, создать список, содержащий все целые числа от 1 до 10, и вывести его на экран."],"metadata":{"id":"auGNjuHE4jgl"}},{"cell_type":"code","execution_count":1,"metadata":{"id":"GHJZieYX375Y","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1701275224177,"user_tz":-180,"elapsed":325,"user":{"displayName":"0000shut","userId":"15669141869569930683"}},"outputId":"36bb3e09-303b-4a97-aa75-49d6824bf9b2"},"outputs":[{"output_type":"stream","name":"stdout","text":["[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]\n"]}],"source":["print([i for i in range(1, 11)])"]},{"cell_type":"markdown","source":[],"metadata":{"id":"MYrzrf126uIX"}},{"cell_type":"markdown","source":["### Ответ: сложность алгоритма - О(n), т.к. объем вычислений (количество итераций цикла) растет линейно с количеством элементов выводимого списка"],"metadata":{"id":"mn8A_xuA6KH-"}},{"cell_type":"markdown","source":["## #17. Написать программу, которая принимает от пользователя строку и выводит True, если строка является палиндромом, и False в противном случае."],"metadata":{"id":"1TfdXs017ONt"}},{"cell_type":"code","source":["def palindrom(item: str) -> bool:\n","    return True if item == item[-1::-1] else False\n","\n","\n","print(palindrom(input(\"Введите строку\")))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Tw7R_72L60Gz","executionInfo":{"status":"ok","timestamp":1701277338881,"user_tz":-180,"elapsed":5934,"user":{"displayName":"0000shut","userId":"15669141869569930683"}},"outputId":"f092679c-3440-4693-e0f6-ea54536c0c53"},"execution_count":13,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите строкуee4\n","False\n"]}]},{"cell_type":"markdown","source":["### Ответ: сложность алгоритма - О(1), т.к. объем вычислений не зависит от длины строки, и выполняется однажды для одной строки ввода"],"metadata":{"id":"1VRafUaf7q2P"}}]}